app/controllers/bookings_controller.rb

SELECT `bookings`.* FROM `bookings`
---
  def index
    @bookings = Booking.all

INSERT INTO `bookings` (`name`, `email`, `phone`, `pax`, `pickup`, `destiny`, `ondate`, `comment`, `hour`, `created_at`, `updated_at`) VALUES ('jose mnuale', 'canache_39@hotmail.com', '04128391530', '23', 'test', 'testing', '2016-09-27', 'testtt', '2016-09-27 18:11:00.000000', '2016-09-27 18:12:01', '2016-09-27 18:12:01')
---
  def create
    @booking = Booking.new(booking_params)

      if @booking.save

UPDATE `bookings` SET `destiny` = 'beachy', `updated_at` = '2016-04-01 01:38:14' WHERE `bookings`.`id` = 1
---
  def update
    respond_to do |format|
      if @booking.update(booking_params)

SELECT  `bookings`.* FROM `bookings` WHERE `bookings`.`id` = 1 LIMIT 1
---
    def set_booking
      @booking = Booking.find(params[:id])